<?php
if (!function_exists('thai_bank_options')) {
    function thai_bank_options(): array
    {
        return [
            'ธนาคารกรุงเทพ จำกัด (มหาชน)',
            'ธนาคารกรุงไทย จำกัด (มหาชน)',
            'ธนาคารกสิกรไทย จำกัด (มหาชน)',
            'ธนาคารไทยพาณิชย์ จำกัด (มหาชน)',
            'ธนาคารกรุงศรีอยุธยา จำกัด (มหาชน)',
            'ธนาคารทหารไทยธนชาต จำกัด (มหาชน) (ttb)',
            'ธนาคารเกียรตินาคินภัทร จำกัด (มหาชน)',
            'ธนาคารซีไอเอ็มบี ไทย จำกัด (มหาชน)',
            'ธนาคารทิสโก้ จำกัด (มหาชน)',
            'ธนาคารยูโอบี (ประเทศไทย) จำกัด (มหาชน)',
            'ธนาคารแลนด์ แอนด์ เฮ้าส์ จำกัด (มหาชน)',
            'ธนาคารไทยเครดิต จำกัด (มหาชน)',
            'ธนาคารสแตนดาร์ดชาร์เตอร์ด (ไทย) จำกัด (มหาชน)',
            'ธนาคารออมสิน',
            'ธนาคารอาคารสงเคราะห์ (ธอส.)',
            'ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร (ธ.ก.ส.)',
            'ธนาคารอิสลามแห่งประเทศไทย',
            'ธนาคารเพื่อการส่งออกและนำเข้าแห่งประเทศไทย (EXIM Bank)',
            'ธนาคารพัฒนาวิสาหกิจขนาดกลางและขนาดย่อมแห่งประเทศไทย (SME D Bank)',
        ];
    }
}
